module.exports.config = {
  name: "Rules",
  version: "2.0.0",
  Permssion: 0,
  credits: "Islamick Chat",
  prefix:false,
  description: "important notes",
  category: " ",
  usages: " ",
  cooldowns: 5,
  dependencies: {
      "request": "",
      "fs-extra": "",
      "axios": ""
  }
};

module.exports.run = async({ api, event, args, client, Users, Threads, __GLOBAL, Currencies }) => {
  const axios = global.nodemodule["axios"];
  const request = global.nodemodule["request"];
  const fs = global.nodemodule["fs-extra"];
  var ZiaRein3 = (`⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n•—»✨আসসালামু আলাইকুম🖤💫

•—»✨ ۵ღ༎-😽🖇️ 𝐍𝟒𝐘𝐀𝐍-𝐗  𝐁𝐎𝐓 𝐁𝐎𝐗 -:) 🩵🌻🪽 এ আপনাকে স্বাগতম\n আমাদের গ্রুপের কিছু নিয়ম কানুন আছে যা হয় তো বা এই গ্রুপ এর অনেক এর জানা নেই তাই \n অবশ্যই গ্রুপের নিয়ম গুলো মেনে চলার চেষ্টা করবেন💜🌸 - আসা করি কেও নিওম বঙ্গ করবেন নাহ -  গ্রুপের rules follow না করলে দেখবেন গ্রুপ আছে কিন্তু আপনি নেই তাই দয়া করে সব কিছু মেনে চলার চেষ্টা করবেন😽🌻!!


⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆


🕋 ｢১｣ - গ্রুপে কার সাথে বাজে ব্যবহার করা যাবে না, নাহলে গ্রুপ থেকে কিক দিবো-!!🥺

🕋 ｢২｣ - পর্ণ কিংবা বাজে ভিডিও দেওয়া যাবে নাহ-!!💜🌸 

🕋 ｢৩｣ - ছোট বড় সবার সাথে ভালো ব্যবহার করতে হবে-!!💚🌺 

🕋 ｢৪｣ বড় হক কিংবা ছোট কাওকে ছোট করে কথা বলা যাবে নাহ-!!😽🌻 

🕋 ｢৫｣ এখানে ইসলাম এর বাহিরে কোনো কথা বলা যাবে নাহ-!!🙂❤️‍🩹

🕋 ｢৬｣ ভাই অনেক কষ্ট করে এডমিন গ্রুপ + বট বানিয়েছে তো দয়া করে  এডমিন কে - সম্মান দিবেন-!!✨🐥

🕋 ｢৭｣ এডমিন খুব ভালো মানুষ আপনার যে কোনো বট এর ফাইল লাগলে তাকে ইনবক্স করবেন-!!🔥🌚

🕋 ｢৮｣ কারো সাথে কোনো রকমের ঝামেলা করা যাবে না _ কোনো সমস্যা হলে গ্রুপের Admin কে জানাবেন-!!🫡🥀

🕋 ｢৯｣ গ্রুপে Admin বট থাকা সত্ত্বেও আর কোনো প্রকার বট অ্যাড করা যাবে না-!!😽🫵

🕋 ｢১০｣ ১৮+ নিয়ে আসলে বা ১৮+ পর্ণ নিয়ে কোনো কথা বললে সাথে সাথে গ্রুপ থেকে বের করে দেওয়া হবে-!!🔥😽

🕋 ｢১১｣ সকল ধর্ম লোক এখানে থাকতে পারবে - কারো ধর্ম যে নিয়ে কাওকে ছোট করা যাবে নাহ - এটা একটি শিক্ষণীয় বট এর থেকে সবাই আমারা ভালো  শিক্ষা নিতে আসেছি

🕋 ｢১২｣ কেও এক ইমজি বার বার দিবেন নাহ - দয়া করে 🥺🥀

🕋 ｢১৩｣ গ্রুপ এর নাম  গ্রুপ পিক কিছু পরিবর্তন করা যাবে নাহ - একমাত্র এডমিন অনুমতি ছাড়া-!!✨🤗

🕋 ｢১৪｣ গ্রুপে কোন spam মেসেজ করা যাবে নাহ-!!😤🙏

🕋 ｢১৫｣ গ্রুপ এ কোন প্রোকার ফিসিং লিংক বা নাসা হেগার এর কোন  লিংক দেওয়া যাবেনা-!!🌸🫡

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

❤️🌸প্রিয় আমার মুসলিম ভাই | বোন তুমাদের জন্য এতো কষ্ট করে গ্রুপ এবং বট বানিয়েছি আল্লাহে কে ভালোবাসলে - এই গ্রুপ ছেরে যেও নাহ 🥺💙 আর গ্রুপ এর নিয়ম গুলো অবশ্যই মেনে চলবা-!!💚😊

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

৫ ওয়াক্তো নামাজ পরো আল্লাহ কে ডাকো - কেনো নাহ - হাসর এর ময়দানে  | বিচার এর কারবালায় এক মাত্রো আল্লাহ-ই- পারবেন তুমাকে জাহান্নামের সেই ভয়াবহ আগুন থেকে রক্ষা করতে 🥺🤲
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
            ‌
দোয়া রইলো তুমাদের জন্য প্রিয় গ্রুপ এর মেম্বার রা-!!❤️🤲

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n`);
 var ZiaRein = [
" ",
  ];
  var ZiaRein2 = () => api.sendMessage({ body: ZiaRein3, attachment: fs.createReadStream(__dirname + "/cache/ZiaRein1.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/ZiaRein1.jpg"), event.messageID);
  return request(encodeURI(ZiaRein[Math.floor(Math.random() * ZiaRein.length)])).pipe(fs.createWriteStream(__dirname + "/cache/ZiaRein1.jpg")).on("close", () => ZiaRein2());
};
